#### `terraform plan` Success
<details><summary>Show Output</summary>

```
  - {
              - chart     = "aws-ecr-credential"
              - name      = "ecr-cred-refresher-default"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - aws             = {
                          - accessKeyId     = "QUtJQVFSS0VKR1RQR1hSV0FISDY="
                          - account         = "037187302622"
                          - region          = "us-west-2"
                          - secretAccessKey = "OFhXYTNWQURuQnNwUHVSQ0FFZW52VUY3Q0drUTEzYnZGTEwwREs2aw=="
                        }
                      - targetNamespace = "default"
                    }
                )
              - version   = "1.4.2"
            },
        ] -> null
      - name                       = "ecr-cred-refresher-default" -> null
      - namespace                  = "default" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://architectminds.github.io/helm-charts/" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.4.2" -> null
      - wait                       = true -> null

      - set {
          - name  = "aws.region" -> null
          - value = "us-west-2" -> null
        }
      - set {
          - name  = "targetNamespace" -> null
          - value = "default" -> null
        }

      - set_sensitive {
          - name  = "aws.accessKeyId" -> null
          - value = (sensitive value)
        }
      - set_sensitive {
          - name  = "aws.account" -> null
          - value = (sensitive value)
        }
      - set_sensitive {
          - name  = "aws.secretAccessKey" -> null
          - value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["prod"] will be created
  + resource "helm_release" "ecr_cred_refresher_default" {
      + atomic                     = false
      + chart                      = "aws-ecr-credential"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ecr-cred-refresher-prod"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://architectminds.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.2"
      + wait                       = true

      + set {
          + name  = "aws.region"
          + value = "us-west-2"
        }
      + set {
          + name  = "targetNamespace"
          + value = "prod"
        }

      + set_sensitive {
          + name  = "aws.accessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.account"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.secretAccessKey"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.container_registries.helm_release.ecr_cred_refresher_default["qa"] will be created
  + resource "helm_release" "ecr_cred_refresher_default" {
      + atomic                     = false
      + chart                      = "aws-ecr-credential"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ecr-cred-refresher-qa"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://architectminds.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.2"
      + wait                       = true

      + set {
          + name  = "aws.region"
          + value = "us-west-2"
        }
      + set {
          + name  = "targetNamespace"
          + value = "qa"
        }

      + set_sensitive {
          + name  = "aws.accessKeyId"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.account"
          + value = (sensitive value)
        }
      + set_sensitive {
          + name  = "aws.secretAccessKey"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.database.digitalocean_database_cluster.api_mysql will be created
  + resource "digitalocean_database_cluster" "api_mysql" {
      + database     = (known after apply)
      + engine       = "mysql"
      + host         = (known after apply)
      + id           = (known after apply)
      + name         = "foreign-language-reader"
      + node_count   = 1
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + region       = "sfo2"
      + size         = "db-s-1vcpu-1gb"
      + uri          = (sensitive value)
      + urn          = (known after apply)
      + user         = (known after apply)
      + version      = "8"
    }

  # module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes will be created
  + resource "digitalocean_database_firewall" "allow_kubernetes" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "9329c2de-f4e2-4f80-be4c-16fefb26477e"
        }
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service must be replaced
-/+ resource "kubernetes_deployment" "language_service" {
      ~ id = "default/language-service" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 10 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
          ~ namespace        = "default" -> "prod" # forces replacement
          ~ resource_version = "2000411" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/default/deployments/language-service" -> (known after apply)
          ~ uid              = "cf632e09-4b8b-4a11-a3cc-f3796eba51d3" -> (known after apply)
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
          ~ replicas                  = 2 -> 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "language-service"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                    labels           = {
                        "app" = "language-service"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                      - args                     = [] -> null
                      - command                  = [] -> null
                      ~ image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:ffa35961c42212776a75c2b27456052c74edf9b7" -> "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:c73332bc3e4232819ffaea6cc52c5034b74b1a21"
                      ~ image_pull_policy        = "IfNotPresent" -> (known after apply)
                        name                     = "language-service"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                      ~ env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                        env {
                            name  = "ELASTICSEARCH_URL"
                            value = "http://elasticsearch-master.default.svc.cluster.local:9200"
                        }
                      ~ env {
                            name = "ELASTICSEARCH_USERNAME"

                            value_from {

                                secret_key_ref {
                                    key  = "username"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                            value_from {

                                secret_key_ref {
                                    key  = "password"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }

                      ~ liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                      ~ port {
                            container_port = 8000
                          - host_port      = 0 -> null
                            protocol       = "TCP"
                        }

                      ~ readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                      ~ resources {
                          ~ limits {
                              + cpu    = (known after apply)
                              ~ memory = "1288490188800m" -> "1.2Gi"
                            }

                          ~ requests {
                              + cpu    = (known after apply)
                                memory = "800Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale must be replaced
-/+ resource "kubernetes_horizontal_pod_autoscaler" "language_service_autoscale" {
      ~ id = "default/language-service" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
          ~ namespace        = "default" -> "prod" # forces replacement
          ~ resource_version = "1998468" -> (known after apply)
          ~ self_link        = "/apis/autoscaling/v1/namespaces/default/horizontalpodautoscalers/language-service" -> (known after apply)
          ~ uid              = "ceb3f669-08ad-4461-9a00-2ce9ed31740f" -> (known after apply)
        }

        spec {
            max_replicas                      = 10
            min_replicas                      = 2
            target_cpu_utilization_percentage = 75

            scale_target_ref {
                api_version = "apps/v1"
                kind        = "Deployment"
                name        = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_secret.language_service_elastic_credentials must be replaced
-/+ resource "kubernetes_secret" "language_service_elastic_credentials" {
        data = (sensitive value)
      ~ id   = "default/language-service-elastic-credentials" -> (known after apply)
        type = "Opaque"

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service-elastic-credentials"
          ~ namespace        = "default" -> "prod" # forces replacement
          ~ resource_version = "847309" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/default/secrets/language-service-elastic-credentials" -> (known after apply)
          ~ uid              = "92b31c99-7d12-4326-9e47-0c0475614644" -> (known after apply)
        }
    }

  # module.infrastructure.module.language_service.kubernetes_service.language_service must be replaced
-/+ resource "kubernetes_service" "language_service" {
      ~ id                    = "default/language-service" -> (known after apply)
      ~ load_balancer_ingress = [] -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "language-service"
          ~ namespace        = "default" -> "prod" # forces replacement
          ~ resource_version = "1368373" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/default/services/language-service" -> (known after apply)
          ~ uid              = "1accf6eb-c9dc-44fc-b3eb-ae914b1e88aa" -> (known after apply)
        }

      ~ spec {
          ~ cluster_ip                  = "10.245.125.99" -> (known after apply)
          - external_ips                = [] -> null
          + external_traffic_policy     = (known after apply)
          - load_balancer_source_ranges = [] -> null
            publish_not_ready_addresses = false
            selector                    = {
                "app" = "language-service"
            }
            session_affinity            = "None"
            type                        = "ClusterIP"

          ~ port {
              ~ node_port   = 0 -> (known after apply)
                port        = 8000
                protocol    = "TCP"
              ~ target_port = "8000" -> (known after apply)
            }
        }
    }

  # module.infrastructure.module.language_service_qa.kubernetes_deployment.language_service will be created
  + resource "kubernetes_deployment" "language_service" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "qa"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = 1
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "language-service"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "language-service"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + dns_policy                       = "ClusterFirst"
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:c73332bc3e4232819ffaea6cc52c5034b74b1a21"
                      + image_pull_policy        = (known after apply)
                      + name                     = "language-service"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name = "AUTH_TOKEN"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "local_connection_token"
                                  + name = "local-connection-token"
                                }
                            }
                        }
                      + env {
                          + name  = "ELASTICSEARCH_URL"
                          + value = "http://elasticsearch-master.default.svc.cluster.local:9200"
                        }
                      + env {
                          + name = "ELASTICSEARCH_USERNAME"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "username"
                                  + name = "language-service-elastic-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "ELASTICSEARCH_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "language-service-elastic-credentials"
                                }
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 5
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/health"
                              + port   = "8000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 8000
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 5
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/health"
                              + port   = "8000"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = "1.2Gi"
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = "800Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = "aws-registry"
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.language_service_qa.kubernetes_horizontal_pod_autoscaler.language_service_autoscale will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "language_service_autoscale" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "qa"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 1
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service_qa.kubernetes_secret.language_service_elastic_credentials will be created
  + resource "kubernetes_secret" "language_service_elastic_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service-elastic-credentials"
          + namespace        = "qa"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.language_service_qa.kubernetes_service.language_service will be created
  + resource "kubernetes_service" "language_service" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "qa"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "language-service"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.language_service_qa.random_password.language_service_elasticsearch_password will be created
  + resource "random_password" "language_service_elasticsearch_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 30 to add, 0 to change, 14 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
